# Статитсик хэрэглээний програмууд семинар 2 
# Дасгал 2.1
bool = c(1,0,1,1)
bools =c()
#boolean = as.logical(bool)
#print(boolean)
for(i in 1:length(bool)){
  if(bool[i]==1)
  {
    bools[i]=TRUE
  }else{
    bools[i]=FALSE
  }
  
}



#Дасгал 2.2
#Алдааг ол
x = c(5,2);
y = c(7,1,3);
x = cbind(x,y);
# Уг дасгалд мөрөөр нийлүүлэх үйлдэл хийж байгаа бөгөөд аргументийн хэмжээ зөрсөн бөгөөд 
# х хувьсагчид 1 утга нэмэх юм уу? эсвэл у хувьсагчаас 1 утга арилгахад алдаа заахгүй 


#Дасгал 2.3
#Алдааг ол
X = 1;
y = x-1;
print(y);
# Х хувьсагчид утга оноосон хэдий ч R Програм том жижиг үсэгээр ялгадаг учир х-г ялгаж байна тиймд алдаа үүсэв


#Дасгал 2.4
# Өгөгдлийн дараах төрлүүдийн аль нь R програмд байдаггүй вэ?
# dataset байдаггүй ажээ.


#Дасгал 2.5
# R Хэлэнд том жижиг үсгийг ялгадаг уу? 
# тиймээ ялгадаг 


#Дасгал 2.6
id = c(12,25)
Price = c(120,39)
price = data.frame(id, Price)
print(price)


#Дасгал 2.7
status = c("accepted", "rejected", "accepted")
status = factor(status)
print(status)


#Дасгал 2.8
#Алдааг олж шалтгааныг тайлбарла
bsb = "BSB service"
next = "NEXT electronics" 
# энд алдаа нь next нь тусгай тогтмол ашиглагддаг функц учир хувьсагчид онооход тохиромжгүй ажээ.


#Дасгал 2.9
#Var хувьсагчийг датафрейм эсэхийг шалгах кодыг бич.
x = c(1,2, 3, 2, 3, 2)
is.data.frame(var(x))
#or 
is.data.frame(var)
#Шалгаж үзэхэд датафрейм биш боллоо


#Дасгал 2.10
#Вектор төрлийн users хувьсагчийн 2, 3 болон 4 дэх утгыг авах командыг бич.
users = c(1:10)
print(users[2])
print(users[3])
print(users[4])


#Дасгал 2.11
#Вектор болон матрицийн элементийн индекс хэдээс эхлэдэг бэ ?
v = c(1:13)
m = matrix(data = c(1,0,0,0,1,0,0,0,1), ncol = 3, byrow = TRUE)
print(v[0])
print(v[1])
print(m[0,0])
print(m[1,1])
#Эндээс харахад вектор болон матрикцийн эхний элементүүд харгалзан индекс нь 1-гэсэн аргументээс эхлэдэг. 
