# Статистик хэрэглээний програмууд Семинар 4 
X = c(1.1, 2.4, -1.0, -1.2, 0.2)
Y = 1:5
ifelse(X>=0 , Y, 0) # ifelse функц вектор утга оруулж эхний параметр нөхцөл, дараах нь үнэн бол, сүүлчийнх худал үедэх үйлдэл хийнэ

ifelse(X>=0, X, -X)# 28.А дасгал дээрх абсолют утгыг илэрхийлдэг функц

ifelse(X>=0, runif(n = 1), 0)# Энэ функц скаляр утга орж ирэхэд үнэн утгыг байнга хэвлэдэг.Вектор утга орж ирвэл векторуудаар гүйдэг.

# Дасгал 30-г сонирхоё
datasets::mtcars
# mtcars$cyl хувьсагчид нэрээр хандахдаа $ тэмдэг ашиглана. 
ifelse(mtcars$cyl <= 4, FALSE, TRUE)
ifelse(mtcars$cyl <= 4, "small", "big") # Вектор дээр ажиллахад тохиромжтой 


# [[]] өгөгдөл дэх утгыг тодорхойлдог, [] энэ нь утга болон хувьсагч нэршилтэй цуг нь гаргадаг

install.packages('epitools')
X = matrix(c(2, 5, 7, 3, 1,0), nrow = 2, dimnames = list(c("row1", "row2"), c("col1","col2", "col3")))
library('epitools')
expand.table(X)


install.packages('zoo')

require(zoo)
 set.seed(123)
  x <- (sample(c(1:9), 10, replace = T))
 y <- lag(x, -1, na.pad = TRUE)
 cbind(x, y)


#Дасгал 26
a = c(-0.1, 0.1, 0.3, 0)
b = c(1, 1.2, 0.9)
'+'(a,b) # b векторын урт а векторын уртаас бага тул + үйлдэл дээр b векторын утгыг цикледэж үйлдлийг гүйцэтгэнэ.

#Дасгал 27
X = c(1.1, 2.4, 2.3, 0.5, -1, 1.7, -1.2, 0.2)
med <- function(x){
  n = length(x); 
  if((n %% 2) != 0){
    return(x[(n+1)/2])
  }else{
    return(0.5*(x[n/2] + x[(n/2)+1]))
  }
}
med(X)

#Дасгал 29
test<- function(type){
  switch(type, 'zero' = 0, 'one' = 1)
}
test('one')
test('zero') #Харамсалтай нь би өгөгдсөн кодыг ажиллуулахад алдаа гарлаа


















