N = 5
u = runif(1) # 1 ширхэг санамсаргүй тоо
x = c(0 , 1, 2, 3, 4, 5) # Интервалуудын цэгүүд
C = c(1/10, 3/10, 2/10, 2/10, 2/10) # Интервалд харгалзах өндөр C 
P = c() # P магадлалыг тодорхойлно
Fu = c() # P магадлалуудын нийлбэр F функц 
Fu[1] = 0 # F-тархалтын функцийн хамгийн эхний утгыг олгоно
for (i in c(1:N)){
  P[i] = C[i]*(x[i+1]-x[i])   # P магадлалыг олж буй давталт 
}
for(i in 1:N){
  Fu[i+1] = Fu[i] + P[i] # F функцийг олж буй давталт
}
for(i in c(1:N+1))
{
  if(Fu[i]<= u & u < Fu[i+1])
  {
    X = x[i] + ((u - Fu[i])/C[i]) # Дурын санамсаргүй хувьсагч u хувьсагч дах 
  }
}
print(X) # X параметрийн утгыг хэвлэе.